; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 813699 1 3 4 5 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared3 - mode
	spectrograph0 - mode
	image2 - mode
	thermograph1 - mode
	GroundStation1 - direction
	Star3 - direction
	GroundStation4 - direction
	Star0 - direction
	Star2 - direction
	Planet5 - direction
	Star6 - direction
	Phenomenon7 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star0)
	(supports instrument1 image2)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
)
(:goal (and
	(have_image Planet5 thermograph1)
	(have_image Star6 image2)
	(have_image Phenomenon7 spectrograph0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 3
2. (turn_to satellite0 star6 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star6)
   goals met: 0 of 3
3. (turn_to satellite0 star2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star2)
   goals met: 0 of 3
4. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 3
5. (turn_to satellite0 star6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star6)
   goals met: 0 of 3
6. (take_image satellite0 star6 instrument1 image2)
   added: (have_image star6 image2)
   goals met: 1 of 3
7. (turn_to satellite0 planet5 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet5)
   goals met: 1 of 3
8. (take_image satellite0 planet5 instrument1 thermograph1)
   added: (have_image planet5 thermograph1)
   goals met: 2 of 3
9. (turn_to satellite0 phenomenon7 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 3
10. (take_image satellite0 phenomenon7 instrument1 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 3 of 3
